### Pandas Day 8

In [3]:
import numpy as np
import pandas as pd

from sqlalchemy import create_engine

In [4]:
temp_db = create_engine('sqlite:///:memory:')

In [6]:
df = pd.DataFrame(data=np.random.randint(0, 100, (4,4)), columns=['a', 'b', 'c', 'd'])
df

    a   b   c   d
0  76  54  36  22
1  30  95  96  35
2  93  48  59  99
3  82  86  64  40

In [ ]:
# now lets store the df in to the sql table in temp_db database
df.to_sql(name='new_table_from_df', con=temp_db)

In [9]:
# now lets read the data from the sql table
new_df = pd.read_sql(sql='new_table_from_df', con=temp_db)
new_df

   index   a   b   c   d
0      0  76  54  36  22
1      1  30  95  96  35
2      2  93  48  59  99
3      3  82  86  64  40